Revit 2027 API
DrawContext.IsInterrupted Method
 Checks whether the current rendering pass has been interrupted.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsInterrupted()
Public Shared Function IsInterrupted As Boolean
public:
static bool IsInterrupted()
static member IsInterrupted : unit -> bool
Return Value
Boolean
 True if the current rendering pass has been interrupted before its completion, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
See Also
Reference
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace